tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "xz"
brew "openssl@3"
brew "gettext"
brew "glib"
brew "cmake"
brew "readline"
brew "ruby"
brew "cocoapods", link: false
brew "curl"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "sqlite"
brew "gobject-introspection"
brew "guile"
brew "ncurses"
brew "htop"
brew "jq"
brew "k9s"
brew "python@3.9"
brew "llvm"
brew "md5sha1sum"
brew "minisat"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "qemu"
brew "redis"
brew "rustup-init"
brew "tcl-tk", link: false
brew "tmux"
brew "tree"
brew "truncate"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "zlib"
cask "1password-cli"
cask "rar"
cask "xquartz"
vscode "4ops.terraform"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "Boto3typed.boto3-ide"
vscode "bungcip.better-toml"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jan-dolejsi.pddl"
vscode "jeff-hykin.better-cpp-syntax"
vscode "lancewilhelm.horizon-extended"
vscode "lextudio.restructuredtext"
vscode "marp-team.marp-vscode"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SolarLiner.linux-themes"
vscode "Taipy.studio-config"
vscode "Taipy.studio-gui"
vscode "Taipy.taipy-studio"
vscode "tamasfe.even-better-toml"
vscode "ThiagoLcioBittencourt.ubuntuvscode"
vscode "tonybaloney.vscode-pets"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "Tyriar.theme-sapphire"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wowbox.code-debuger"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
